# Variable ตัวแปร : x = 3 

# ผมมีซื้อ 1.5 BTC ที่ราคา 20,000 ในวันนี้ btc ต่อหน่วยราคา 60,000 หากผมต้องการเอาทุนออก 
# ผมต้องขาย BTC จำนวนเท่าไหร่ ??
# + - * /
# integer : จำนวนเต็ม -2 , - 1 , 0 , 1 , 2
# float : จำนวนที่มีทศนิยม -2.1 , -1.4 , 0.5 , 1.2 , 1.0

จำนวนBTCที่ผมซื้อ = float(input("จำนวน BTC ที่ซื้อ : ")) # btc 0.001223 doge 0.0000032131
ราคาที่ผมซื้อ = 20000 # บาทต่อbtc
ราคาbtcวันนี้ = 60000 # บาทต่อbtc

# string : กลุ่มตัวอักษรหรือเดี่ยว เชื่อม string เข้าหากัน

ผมชื่อว่า = "mr.pybott"

ต้นทุนผมเป็นจำนวนเงิน = จำนวนBTCที่ผมซื้อ * ราคาที่ผมซื้อ
มูลค่าBTCในวันนี้ = ราคาbtcวันนี้ * จำนวนBTCที่ผมซื้อ

จำนวนที่ผมต้องขายเพื่อเอาทุนออก = ต้นทุนผมเป็นจำนวนเงิน / ราคาbtcวันนี้ 

print("\n")

print(ผมชื่อว่า + " ต้องทำการขาย BTC จำนวน : " + str(จำนวนที่ผมต้องขายเพื่อเอาทุนออก) + " BTC เพื่อเอาทุนออก")

print("คุณ " + ผมชื่อว่า + " จะเหลือ BTC อยู่จำนวน : " + str(จำนวนBTCที่ผมซื้อ - จำนวนที่ผมต้องขายเพื่อเอาทุนออก) + " BTC")

print("\n")

input("")



